// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным. 


//S1.1. Вывести на экран число  с точностью до сотых.

double a = 12.352465;
a = Math.Round(a, 2);
Console.WriteLine($"число  с точностью до сотых {a}");